Repository: Zakirov-Yuriy/home_fitness
Catalog: lib/l10n/intl_*.arb
Languages: ru

# frog_jumps_description
source: Frog Jump: Wide squat, touch the floor with your hands. Jump up forcefully, spreading your arms out to the sides. Land back into a squat and repeat.
ru: Лягушка прыгает: Сделайте широкий присед, коснитесь пола руками. С силой прыгните вверх, разведя руки в стороны. Приземлитесь обратно в приседание и повторите.

source: Tight arms
ru: Подтянутые руки

# Tight_arms2
source: Tight arms
ru: Подтянутые руки

source: Best for hands and forearms
ru: Лучше всего подходит для рук и предплечий

source: Dumbbell Forward Raise
ru: Подъем гантелей вперед

# Dumbbell_Forward_Raise_description
source: Dumbbell Front Raise: Hold a dumbbell in each hand and stand straight. Raise the dumbbells forward, keeping your arms straight and controlled. Return to the starting position with control.
ru: Подъем гантелей вперед: Возьмите гантели в каждую руку, станьте прямо. Поднимите гантели вперед, сохраняя прямые руки и контролируя движение. Вернитесь в исходное положение с контролем.

source: Upper triceps press
ru: Верхний жим трицепса

# Upper_triceps_press_description
source: Upper Triceps Press: Lie on a bench or floor and hold dumbbells in your hands above your chest with your arms straight. Bend your elbows, lowering the dumbbells towards your head. Return to the starting position, raising the dumbbells up.
ru: Верхний жим трицепса: Лягте на скамью или пол, возьмите гантели в руки над грудью с прямыми руками. Согните руки в локтях, опуская гантели к голове. Вернитесь в исходное положение, поднимая гантели вверх.

source: Dumbbell row with slope
ru: Гантельный ряд с наклоном

# Dumbbell_row_with_slope_description
source: Incline Dumbbell Row: Hold a dumbbell in each hand and stand straight. Bend forward, holding dumbbells in front of you. Raise the dumbbells toward your body, contracting your shoulder blades. Lower the dumbbells back down and repeat.
ru: Гантельный ряд с наклоном: Возьмите гантели в каждую руку, станьте прямо. Наклонитесь вперед, держа гантели перед собой. Поднимите гантели к телу, сокращая лопатки. Спускайте гантели обратно и повторите.

source: Dumbbell Raise
ru: Подъем гантелей

# Dumbbell_Raise_description
source: Dumbbell Raise: Hold a dumbbell in each hand and stand straight. Raise the dumbbells toward your shoulders, keeping your arms straight and controlled. Lower the dumbbells back down and repeat.
ru: Подъем гантелей: Возьмите гантели в каждую руку, станьте прямо. Поднимите гантели к плечам, сохраняя прямые руки и контролируя движение. Спустите гантели обратно и повторите.

source: Swings with dumbbells
ru: Махи с гантелями

# Swings_with_dumbbells_description
source: Dumbbell swings: Take dumbbells in your hands and stand straight. Extend your arms to the sides, lifting the dumbbells to shoulder level. Slowly lower the dumbbells back down and repeat the movement.
ru: Махи с гантелями: Возьмите гантели в руки, станьте прямо. Разведите руки в стороны, поднимая гантели до уровня плеч. Медленно опустите гантели обратно и повторите движение.

source: Standing hammer curl
ru: Скручивание молота стоя

# Standing_hammer_curl_description
source: Standing hammer curl: Hold a dumbbell in your hand and stand straight. Raise the dumbbell in front of you to shoulder level. Rotate your torso in the direction opposite your arm, twisting your torso. Return to starting position and repeat on the other side.
ru: Скручивание молота стоя: Возьмите гантель в руку, станьте прямо. Поднимите гантель перед собой на уровень плеч. Поворачивайте торс в сторону противоположной руке, скручивая корпус. Вернитесь в исходное положение и повторите на другой стороне.

source: Military dumbbell press in a seated position
ru: Военный жим гантелей в положении сидя

# Military_dumbbell_press_in_a_seated_position_description
source: Seated Dumbbell Military Press: Sit on a bench with your back supported. Take the dumbbells in your hands and lift them to your shoulders. Straighten your arms up, lifting the dumbbells above your head. Lower the dumbbells back to your shoulders and repeat the movement.
ru: Военный жим гантелей в положении сидя: Сядьте на скамью с поддержкой спины. Возьмите гантели в руки и поднимите их к плечам. Выпрямите руки вверх, поднимая гантели над головой. Опустите гантели обратно к плечам и повторите движение.

source: Push-ups on one knee
ru: Отжимания на одном колене

# Push_ups_on_one_knee_description
source: One Knee Push-Ups: Get on your knees and hands, supporting your upper body. Lower your upper body by bending your elbows. Return to the starting position with your arms straight. Repeat the exercise on one knee, then switch to the other.
ru: Отжимания на одном колене: Встаньте на колени и руки, поддерживая верхнее тело. Опустите верхнее тело, согнув руки в локтях. Вернитесь в исходное положение, выпрямив руки. Повторите упражнение на одном колене, затем переключитесь на другое.

source: Program 16x21
ru: Программа 16x21

source: Face Exercises
ru: Упражнения для лица

# Face_Exercises2
source: Face Exercises
ru: Упражнения для лица

source: Best suited for the face
ru: Лучше всего подходит для лица

source: AEIOU
ru: Эиоу

# AEIOU_description
source: Facial exercise: Form an “O” with your lips and hold this pose for a few seconds, then relax. This may temporarily help strengthen the muscles in your cheeks and lips.
ru: Упражнение для лица: Формирование "О" губами и удерживание этой позы на несколько секунд, затем расслабление. Это упражнение может помочь укрепить мышцы щек и губ.

source: CHEEK FIRMER
ru: Щека укрепления

# CHEEK_FIRMER_description
source: Smile widely, extending your lips towards your ears. Press your cheeks towards your teeth, holding for 5-10 seconds. Relax your muscles. Repeat 10-15 times. This exercise will help strengthen and tone the cheek muscles and tighten the contours of the face.
ru: Улыбнитесь широко, вытягивая губы к ушам. Напрягите щеки к зубам, удерживая 5-10 секунд. Расслабьте мускулатуру. Повторите 10-15 раз. Это упражнение поможет укрепить и тонизировать мышцы щек и подтянуть контуры лица.

source: DRAWN CHEEKS
ru: Нарисованные щеки

# DRAWN_CHEEKS_description
source: Sit up straight, helping yourself with your hands to tighten the skin on your cheekbones. Tighten your cheek muscles and hold for 5-10 seconds. Relax your cheeks and repeat 10-15 times. This exercise strengthens and tightens the cheek muscles, making facial contours more expressive.
ru: Сядьте прямо, помогая себе руками, чтобы натянуть кожу на скулах. Напрягите мышцы щек и удерживайте на 5-10 секунд. Расслабьте щеки и повторите 10-15 раз. Это упражнение укрепляет и подтягивает мышцы щек, делая контуры лица более выразительными.

source: EYE LIFT
ru: Лифт глаза

# EYE_LIFT_description
source: Sit up straight, close your eyes. Tighten the muscles around your eyes, raising your eyebrows as high as possible. Hold for 5-10 seconds, then relax and repeat 10-15 times. This exercise firms and tightens the skin around the eyes, reducing wrinkles and giving a more youthful appearance.
ru: Сядьте прямо, закройте глаза. Напрягите мышцы вокруг глаз, поднимая брови как можно выше. Удерживайте на 5-10 секунд, затем расслабьте и повторите 10-15 раз. Это упражнение укрепляет и подтягивает кожу вокруг глаз, уменьшая морщины и придавая более молодой вид.

source: EYES CIRCLES
ru: Круги глаз

# EYES_CIRCLES_description
source: Sit up straight, close your eyes. Draw circular movements with your eyes in one direction, then in the other. Repeat 10-15 times in each direction. This exercise improves blood circulation, relieves eye strain and fatigue, and also improves skin tone and reduces the appearance of wrinkles.
ru: Сядьте прямо, закройте глаза. Нарисуйте круговые движения глазами в одном направлении, затем в другом. Повторите по 10-15 раз в каждом направлении. Это упражнение улучшает кровообращение, снимает напряжение и усталость глаз, а также улучшает тонус кожи и уменьшает появление морщин.

source: JAW LINE
ru: Линия челюсти

# AW_LINE_description
source: Sit up straight, lean back, raising your face to the ceiling. Purse your lips while lifting your lower face and chin. Hold the pose for 5-10 seconds, then relax and repeat 10-15 times. This exercise strengthens the chin muscles and adds contour and lift to the face.
ru: Сядьте прямо, наклонитесь назад, поднимая лицо к потолку. Сморщите губы, поднимая нижнюю часть лица и подбородок. Удерживайте позу 5-10 секунд, затем расслабьте и повторите 10-15 раз. Это упражнение укрепляет мышцы подбородка и придает контур и подтянутость лицу.

source: LION
ru: Лев

# LION_description
source: Sit up straight, open your mouth wide and stick out your tongue. Turn your eyes upward and tense your facial muscles. Hold for 5-10 seconds, then relax and repeat 10-15 times. This exercise helps strengthen and stretch the facial muscles, improving the contour and tone of the skin.
ru: Сядьте прямо, откройте рот широко и высуньте язык. Поверните глаза вверх и напрягите лицевые мышцы. Удерживайте на 5-10 секунд, затем расслабьте и повторите 10-15 раз. Это упражнение помогает укрепить и растянуть мышцы лица, улучшая контур и тонус кожи.

source: NOSE TOUCHING
ru: Прикосновение носа

# NOSE_TOUCHING_description
source: Sit up straight, relax your shoulders. Extend your tongue towards your nose or as close as possible. Hold for a few seconds, then return to the starting position. Repeat several times. Exercise strengthens and stretches the muscles of the tongue and face, increasing their tone and flexibility.
ru: Сядьте прямо, расслабьте плечи. Вытяните язык к носу или как можно ближе. Удерживайте на несколько секунд, затем вернитесь в исходное положение. Повторите несколько раз. Упражнение укрепляет и растягивает мышцы языка и лица, повышая их тонус и гибкость.

source: PUFFY CHEEKS
ru: Пухлые щеки

# PUFFY_CHEEKS_description
source: Sit up straight, relax your shoulders. Inflate your cheeks with air, holding it for 5-10 seconds. Exhale slowly and relax your cheeks. Repeat several times. This exercise strengthens and tones the cheek muscles, reducing puffiness and lifting the face.
ru: Сядьте прямо, расслабьте плечи. Надуйте щеки воздухом, удерживая его 5-10 секунд. Медленно выдохните и расслабьте щеки. Повторите несколько раз. Это упражнение укрепляет и тонизирует мышцы щек, уменьшая пухлость и подтягивая лицо.

source: SMILE
ru: Улыбка

# SMILE_description
source: Sit up straight, relax your shoulders. Smile widely, holding it for a few seconds. Relax your muscles and repeat. Strengthens and tightens facial muscles, making the contour brighter and more expressive.
ru: Сядьте прямо, расслабьте плечи. Широко улыбнитесь, удерживая на несколько секунд. Расслабьте мышцы и повторите. Укрепляет и подтягивает мышцы лица, делает контур более ярким и выразительным.

source: UNDERCHIN DUCK
ru: Подподбородочная уточка

# UNDERCHIN_DUCK_description
source: Pull your chin towards your neck, hold for a few seconds, relax and repeat. It strengthens the chin and neck muscles, combats double chin and gives the face a more toned contour.
ru: Подтяните подбородок к шее, удерживайте на несколько секунд, расслабьте и повторите. Это укрепляет мышцы подбородка и шеи, борется с двойным подбородком и придает лицу более подтянутый контур.

# SMILING_FISH_FACE_description
source: A wide smile, then a fish-like grimace with protruding cheeks. Hold the pose, repeat. The exercise strengthens and tones the facial muscles, making the contour more expressive.
ru: Широкая улыбка, затем рыбья гримаса с выпяченными щеками. Удерживайте позу, повторите. Упражнение укрепляет и тонизирует мышцы лица, делая контур более выразительным.

source: SMILING FISH FACE
ru: Улыбка рыбье лицо
