Repository: Zakirov-Yuriy/home_fitness
Catalog: lib/l10n/intl_*.arb
Languages: ru

source: Fitness for Women
ru: Фитнес для женщин

source: Login to account
ru: Войти в аккаунт

source: Go to account
ru: Перейти в аккаунт

source: Program
ru: Программа

# Log_in
source: Log in to access full content.
ru: Войдите впрофиль, чтобы получить доступ к полному контенту.

source: Begin
ru: Начать

source: Program 8x20
ru: Программа 8x20

source: Removing belly fat
ru: Убираем жир с живота

# Removing_belly_fat2
source: Removing belly fat
ru: Убираем жир с живота

source: Best for sides and belly
ru: Лучше всего подходит для боков и живота

source: Exercises
ru: Упражнений

source: Minutes
ru: Минут

source: List of exercises
ru: Список упражнений

source: Close
ru: Закрыть

source: Animation
ru: Анимация

source: Video
ru: Видео

source: Duration
ru: Длительность

source: Program 9x23
ru: Программа 9x23

source: Program 8x21
ru: Программа 8x21

source: Full body workout
ru: Тренировка всего тела

source: Melt the fat
ru: Растопить жир

source: Whole body
ru: Всё тело

source: SHORT EXERCISES INTENSIVE AND SATURAL
ru: КОРОТКИЕ УПРАЖНЕНИЯ ИНТЕНСИВНЫЙ И НАСЫЩЕННЫЙ

source: Running
ru: Бег

# bug_description
source: This workout is an excellent cardio exercise and can be an effective part of your fitness regimen. It improves endurance, strengthens the legs and buttocks, and helps burn calories.
ru: Эта тренировка является отличным кардионагрузочным упражнением и может быть эффективной частью фитнес-регима. Она улучшает выносливость, укрепляет ноги и ягодицы, а также способствует сжиганию калорий.

source: three repeat 60s
ru: 3 повторение 60s

source: Sumo squats jumping
ru: Сумо приседания прыжки

# Sumo_description
source: Sumo Squats with Jumps: Get into a wide-legged position with your toes pointing out. Squat down, then jump up with force. Repeat for leg strength and cardio.
ru: Сумо приседания с прыжками: станьте в позу с широким расставлением ног, носки наружу. Приседайте, затем с силой прыгайте вверх. Повторяйте для укрепления ног и кардио.

source: Mountain climbers
ru: Горные альпинисты

# Star_Leap
source: Star Jump
ru: Звездный прыжок

source: Boxing Jabs
ru: Боксерские джебы

source: High Knees
ru: Высокие колени

source: Lunge jumping
ru: Прыжки с выпадом

source: Side lunges
ru: Боковые выпады

source: Lateral hip raises
ru: Боковые подъемы бедер

# Lateral_hip_raises_description
source: Lie on your side, lift your top leg up, then lower it down. Strengthen your side muscles and shape your waist. Repeat for better results.
ru: Лягте на бок, поднимайте верхнюю ногу вверх, затем опускайте. Укрепляйте боковые мышцы и формируйте талию. Повторяйте для лучших результатов.

source: Ranks of the Renegades
ru: Ряды ренегатов

# Ranks_of_the_Renegades_description
source: Take dumbbells and get into a push-up position. Lift the dumbbells to your shoulder one at a time, maintaining balance. Strengthen your core and arms. Repeat for strength and stability.
ru: Возьмите гантели, станьте в позу отжимания. Поднимите поочередно гантели к плечу, сохраняя равновесие. Укрепляйте ядро и руки. Повторяйте для силы и стабильности.

source: Military Seated Press
ru: Военный жим сидя

# Military_Seated_Press_description
source: Sit on a bench with back support, take dumbbells. Raise them above your head, then lower them to shoulder level. Strengthen your shoulders and triceps. Repeat to develop strength.
ru: Садитесь на скамью с поддержкой для спины, возьмите гантели. Поднимайте их над головой, затем опускайте до уровня плеч. Укрепляйте плечи и трицепсы. Повторяйте для развития силы.

source: Push-up
ru: Отжимание

# Push_up_description
source: Lie face down on your palms and toes. Bend your arms, lowering your body, then push up, straightening your arms. Strengthen your chest, shoulders and arms. Repeat for strength and endurance.
ru: Лягте лицом вниз, опираясь на ладони и носки. Сгибайте руки, опуская тело, затем отжимайтесь, выпрямляя руки. Укрепляйте грудь, плечи и руки. Повторяйте для силы и выносливости.

source: Lifting armor on one arm
ru: Подъем лат на одной руке

# Lifting_armor_on_one_arm_description
source: Take the dumbbell in your hand and lean forward. Raise the dumbbell up, bending your elbow. Strengthen your upper back and shoulders. Repeat on both sides.
ru: Возьмите гантель в руку, наклонитесь вперед. Поднимите гантель вверх, согнув руку в локте. Укрепляйте верхнюю часть спины и плечи. Повторяйте на обеих сторонах.

source: Standing delt rotations
ru: Вращения дельт стоя

# Standing_delt_rotations_description
source: Hold a dumbbell in each hand and stand straight. Raise your arms to the sides to shoulder level, then rotate them forward and back. Strengthen your shoulders and deltoids. Repeat for strength and stability.
ru: Возьмите гантель в каждую руку, станьте прямо. Поднимайте руки в стороны до уровня плеч, затем вращайте их вперед и назад. Укрепляйте плечи и дельты. Повторяйте для силы и стабильности.

source: Front lift
ru: Передний подъем

# Front_lift_description
source: Hold a dumbbell in each hand and stand straight. Raise your arms forward from your body to shoulder level, then lower them. Strengthen your shoulders and front deltoids. Repeat for strength and tone.
ru: Возьмите гантель в каждую руку, станьте прямо. Поднимайте руки вперед от корпуса до уровня плеч, затем опускайте. Укрепляйте плечи и передние дельты. Повторяйте для силы и тонуса.

source: Swimmers
ru: Пловцы

# Swimmers_description
source: Swimming is an exercise in which a person is in a prone position in the water, arms extended forward, and legs floating on the surface of the water. Swimming is an excellent cardio exercise that strengthens the muscles of the back, shoulders and arms, and improves endurance and coordination.
ru: Пловцы - это упражнение, при котором человек находится в положении лежа на животе в воде, руки вытянуты вперед, а ноги плывут на поверхности воды. Плавание - это отличное кардиоупражнение, которое укрепляет мышцы спины, плеч и рук, а также улучшает выносливость и координацию.

source: Slant row
ru: Наклонный ряд

# Slant_row_description
source: Incline Row: Stand in a supine position, tilting your upper body forward at an angle to the floor. Take a dumbbell in each hand and lower them down. Pull the dumbbells towards your stomach, bending your elbows. Strengthen your back and upper back muscles. Repeat for strength and tone.
ru: Наклонный ряд: станьте навскидку, наклоните верхнюю часть тела вперед под углом к полу. Возьмите гантель в каждую руку, опустите их вниз. Тяните гантели к животу, сгибая локти. Укрепляйте спину и мышцы верхней части спины. Повторяйте для силы и тонуса.

source: Program 10x24
ru: Программа 10x24

source: Program 9x25
ru: Программа 9x25

source: Leg and thigh workout
ru: Тренировка ног и бедер

source: Buttocks and legs
ru: Ягодицы и ноги

source: Legs and Hips
ru: Ноги и бедра

source: Best suited for legs and thighs
ru: Лучше всего подходит для ног и бедер

# High_Knees_description
source: Run in place, raising your knees as high as possible. Pick up the pace for more cardio and improved leg strength. Effective for warming up.
ru: Бегите на месте, поднимая колени как можно выше. Увеличивайте темп для усиленной кардионагрузки и улучшения силы ног. Эффективно для разминки.

source: three rep 30s
ru: 3 повторение 30s

# Side_lunges_description
source: Stand straight, take a step to the side, bending one leg at the knee. Return to the starting position. Strengthen your thighs and buttocks. Repeat for balance and strength.
ru: Стойте прямо, делайте шаг вбок, сгибая одну ногу в колене. Возвращайтесь в исходное положение. Укрепляйте бедра и ягодицы. Повторяйте для баланса и силы.

source: Kettlebell Squat
ru: Приседание с гирей

# Kettlebell_Squat_description
source: Kettlebell Squat: Grab a kettlebell, holding it at chest or shoulder level. Stand straight, lower yourself into a squat until parallel to the floor, then rise up. Strengthen your legs and buttocks. Repeat for strength and tone.
ru: Приседание с гирей: возьмите гирю, держа ее на уровне груди или плеч. Станьте прямо, опуститесь в присед до параллели с полом, затем поднимитесь. Укрепляйте ноги и ягодицы. Повторяйте для силы и тонуса.

source: Rowing on one leg
ru: Гребля на одной ноге

# Rowing_on_one_leg_description
source: Single-leg rowing is an exercise performed in the gym on machines with back support. A person sits on the machine and, holding a handle or handle, moves the leg back and forth, emulating the motion of rowing. This exercise develops strength, endurance and coordination in the legs and buttocks.
ru: Гребля на одной ноге - это упражнение, выполняемое в тренажерном зале на тренажерах с поддержкой для спины. Человек сидит на тренажере и, удерживая рукоятку или рукоять, двигает ногу вперед и назад, эмулируя движение гребли. Это упражнение развивает силу, выносливость и координацию в ногах и ягодицах.

source: Bulgarian squats
ru: Болгарские приседания

# Bulgarian_squats_description
source: Bulgarian squats: stand with your back to a bench, place one foot on it, the other foot in front. Lower yourself into a squat, bending your front leg, then rise up. Strengthen your legs and buttocks. Repeat for strength and balance.
ru: Болгарские приседания: станьте спиной к скамье, поставьте одну ногу на нее, другая нога впереди. Опуститесь в присед, сгибая переднюю ногу, затем поднимитесь. Укрепляйте ноги и ягодицы. Повторяйте для силы и баланса.

source: Donkey Kicks
ru: Ослиные удары

# Donkey_Kicks_description
source: Donkey Kicks: Start on all fours. Lean one leg back, then lift it high up, bringing your knee toward your chest. Repeat with the other leg. Strengthen your buttocks and lower back.
ru: Ослиные удары: начните в положении стойки на четвереньках. Отклоняйте одну ногу назад, затем поднимайте ее высоко наверх, поднимая колено к груди. Повторите с другой ногой. Укрепляйте ягодицы и нижнюю часть спины.

source: Squats and dumbbell press
ru: Приседания и жим гантелей

# Squats_and_dumbbell_press_description
source: Squats and Dumbbell Press: Stand up straight with dumbbells on your shoulders. Do a squat, then rise up and press the dumbbells up at the same time. Strengthen your legs, buttocks, shoulders and arms. Repeat for strength and endurance.
ru: Приседания и жим гантелей: станьте прямо с гантелями на плечах. Сделайте присед, затем поднимитеся и одновременно нажмите гантели вверх. Укрепляйте ноги, ягодицы, плечи и руки. Повторяйте для силы и выносливости.

source: Single Leg Raise
ru: Подъем одной ноги

# Single_Leg_Raise_description
source: Single Leg Raise: Stand next to a stand or bench. Raise one leg, keeping it bent at the knee, then slowly lower it. Strengthen your buttocks and legs. Repeat on each leg for balance and strength.
ru: Подъем одной ноги: станьте рядом с подставкой или скамьей. Поднимите одну ногу, держа ее согнутой в колене, затем медленно опустите. Укрепляйте ягодицы и ноги. Повторяйте на каждой ноге для баланса и силы.

source: Wall Squats
ru: Приседания у стены

# Wall_Squats_description
source: Wall Squats: Stand with your back to a wall, feet shoulder-width apart. Slowly lower yourself into a squat until your back touches the wall, then return to the starting position. Strengthen your legs and buttocks. Repeat for strength and stability.
ru: Приседания у стены: станьте спиной к стене, ноги на ширине плеч. Медленно опуститесь в присед, пока спина не коснется стены, затем вернитесь в исходное положение. Укрепляйте ноги и ягодицы. Повторяйте для силы и стабильности.

# Buttocks_and_legs2
source: Buttocks and legs
ru: Ягодицы и ноги

# Best_suited_for_legs_and_thighs2
source: Best suited for legs and thighs
ru: Лучше всего подходит для ног и бедер

source: Pistol Squats
ru: Приседания с пистолетом

# Pistol_Squats_description
source: Pistol squats: Stand on one leg with the other straight out in front. Lower yourself slowly, bending your working knee as if doing a one-legged squat. Return to the starting position. Strengthen your legs and balance. Repeat on each leg.
ru: Приседания с пистолетом: станьте на одну ногу, другую прямо вытяните вперед. Медленно опуститесь, сгибая работающее колено, как бы делая присед на одной ноге. Вернитесь в исходное положение. Укрепляйте ноги и баланс. Повторяйте на каждой ноге.

source: Gluteal Bridge
ru: Ягодичный мостик

# Gluteal_Bridge_description
source: Glute Bridge: Lie on your back with your legs bent and feet flat on the floor. Slowly lift your hips up, squeezing your buttocks. Pause at the top, then slowly lower back down. Strengthen your buttocks and back. Repeat for strength and tone.
ru: Ягодичный мостик: лягте на спину, согните ноги и поставьте стопы на полу. Медленно поднимите бедра вверх, сжимая ягодицы. Задержитесь на верхней точке, затем медленно опуститесь обратно. Укрепляйте ягодицы и спину. Повторяйте для силы и тонуса.

# Lunge_jumping_description
source: Step forward by lunging onto one leg, then jump up and switch legs in the air. Strengthen your legs and buttocks. Repeat for an effective training routine.
ru: Прыжки с выпадом: станьте в исходное положение с ногами на ширине плеч. Сделайте шаг вперед и опуститесь в позу выпада, затем мощно прыгните вверх, меняя положение ног. Повторяйте на обеих ногах для укрепления ног и ягодиц.

source: Leg raises on a bench
ru: Подъемы ног на скамье

# Leg_raises_on_a_bench_description
source: Bench Leg Raises: Lie on your back with your hands under your buttocks for support. Raise your legs straight up, bending your knees at right angles. Slowly lower your legs back down. Strengthen your lower abdomen. Repeat for strength and stability.
ru: Подъемы ног на скамье: лягте на спину, положите руки под ягодицы для поддержки. Поднимите ноги прямо вверх, согнув их в коленях под прямым углом. Медленно опустите ноги обратно. Укрепляйте нижнюю часть живота. Повторяйте для силы и стабильности.

source: Thigh Tuck
ru: Подтягивание бедра

# Thigh_Tuck_description
source: Hip Tightening: Sit on the Thigh Tightening Machine, adjust the weight, and select the desired level of resistance. Place the pad at the desired level so that the upper thigh is definitely supported. Bend your hip and lift it, then lower it slowly. Repeat for the other leg.
ru: Подтягивание бедра: сядьте на тренажер для подтягивания бедра, настройте вес и выберите желаемый уровень нагрузки. Разместите подкладку на нужном уровне, чтобы верхняя часть бедра была определенно поддержана. Согните бедро и поднимите его, затем медленно опустите. Повторите для другой ноги.

source: Push-ups with clapping
ru: Отжимания с хлопками

# Push_ups_with_clapping_description
source: Clapping Push-Ups: Get into a push-up position on the floor with your hands shoulder-width apart. Lower your body down, then push off the floor with force and clap your hands underneath you, returning to the starting position. This exercise develops upper body strength and improves endurance.
ru: Отжимания с хлопками: Встаньте в позу отжимания на полу, руки на ширине плеч. Опустите тело вниз, затем с силой оттолкнитесь от пола и сделайте хлопок руками под собой, вернитесь в исходное положение. Это упражнение развивает силу в верхней части тела и улучшает выносливость.

source: Rise of Garhammer
ru: Подъем Гархаммер

# Rise_of_Garhammer_description
source: Garhammer Lift: Lie on the floor on your stomach with your arms extended along your body. Bend your knees and lift your feet toward your hips. Tighten the muscles in your buttocks and lower back, then lift your upper body, trying to reach your buttocks with your shoulders. Slowly lower your upper body back to the floor. Repeat to strengthen and develop the muscles of the buttocks and back.
ru: Подъем Гархаммер: Лягте на пол на животе, руки вытянуты вдоль тела. Согните колени и поднимите стопы к бедрам. Напрягите мышцы ягодиц и нижней части спины, затем поднимите верхнюю часть тела, пытаясь дотянуться плечами до ягодиц. Замедленно опустите верхнюю часть тела обратно на пол. Повторите для укрепления и развития мышц ягодиц и спины.

source: Crunch
ru: Xруст

# Crunch_description
source: Crunch is an abdominal exercise while lying on your back. Lie down with your knees bent and your hands behind your head. Focus on your stomach, lift your shoulders off the floor, do not strain your neck. Rise to a 30° angle, hold, and lower slowly. Repeat for strength and control.
ru: Crunch - упражнение для пресса, лежа на спине. Лягте с согнутыми в коленях ногами и руками за головой. Сделайте упор на живот, поднимите плечи от пола, не тяните шею. Поднимитесь до угла 30°, задержитесь и медленно опуститесь. Повторите для силы и контроля.

source: Knife from a prone position
ru: Нож из положения лежа

# Knife_from_a_prone_position_description
source: Prone Knife: Start by lying on your back with your arms and legs extended. Lift your upper body and legs off the floor at the same time, trying to touch them, forming a curved body shape that resembles a knife. Hold this position for a moment, then slowly return to the starting position. Repeat to strengthen your core and abs.
ru: Нож из положения лежа: Начните с положения лежа на спине с вытянутыми руками и ногами. Поднимите одновременно верхнюю часть тела и ноги с пола, пытаясь их соприкоснуться, образуя изогнутую форму тела, напоминающую нож. Задержитесь в этом положении на мгновение, затем медленно вернитесь в исходное положение. Повторите для укрепления кора и пресса.

source: Glute bridge and leg lifts
ru: Ягодичный мостик и подъем ног

# Glute_bridge_and_leg_lifts_description
source: Glute Bridge and Leg Raise: Lie on your back with your legs bent. Raise your hips while squeezing your glutes. Lift your leg up, then slowly lower it. Repeat with the other leg.
ru: Ягодичный мостик и подъем ног: Лягте на спину, согните ноги. Поднимите бедра, напрягая ягодицы. Поднимите ногу вверх, затем медленно опустите. Повторите с другой ногой.

source: Program 9x21
ru: Программа 9x21

source: Elastic buttocks
ru: Упругие ягодицы

source: Tight buttocks
ru: Подтянутые ягодицы

source: Big Booty
ru: Большая попка

# Elastic_buttocks2
source: Elastic buttock
ru: Упругие ягодицы

source: Body weight squats
ru: Приседания с весом тела

# Body_weight_squats_description
source: Bodyweight Squats: Stand straight with your feet shoulder-width apart. Distribute your body weight through your heels and lift your chest. Bend your knees and lower yourself down as if sitting in a chair, keeping your back straight. Lower yourself until your thighs are parallel to the floor, then rise back up to the starting position. The exercise strengthens the lower body, including the buttocks, thighs and quadriceps.
ru: Приседания с весом тела: Станьте прямо, ноги на ширине плеч. Распределите вес тела на пятки и поднимите грудь. Согните колени и опуститесь вниз, как будто садитесь на стул, сохраняя прямую спину. Опуститесь до того момента, когда бедра станут параллельны полу, затем поднимитесь обратно в исходное положение. Упражнение укрепляет нижнюю часть тела, включая ягодицы, бедра и квадрицепсы.

source: Side Leg Crosses
ru: Боковые скрещивания ног

# Side_Leg_Crosses_description
source: Side Leg Crosses: Lie on your side, resting on your forearms and elbows to keep your upper body supported. Bend your top leg and place it on the floor in front of your bottom leg. Tighten your lateral abdominal muscles and lift your bottom leg, crossing it over your top leg. Slowly lower your leg back to the floor. Repeat the exercise on one side for the set number of reps, then switch to the other side.
ru: Боковые скрещивания ног: Лягте на бок, упритесь на предплечья и локти, чтобы ваш верхний корпус был поддержан. Согните верхнюю ногу и положите ее на полу перед нижней ногой. Напрягите боковые мышцы пресса и поднимите нижнюю ногу, скрестив ее над верхней ногой. Замедленно опустите ногу обратно на пол. Повторите упражнение на одной стороне в течение заданного количества повторений, затем переключитесь на другую сторону.

source: Reverse lunge with front leg raised
ru: Обратный выпад с поднятой передней ногой

# Reverse_lunge_with_front_leg_raised_description
source: Reverse Lunge: Stand up straight and lift one leg back, bending the knee. Lower your pelvis by bending your other knee. Lift your pelvis back up. Repeat with the other leg.
ru: Обратный выпад: Станьте прямо, поднимите одну ногу назад, согнув ее в колене. Опустите таз, согнув другую ногу в колене. Поднимите таз обратно. Повторите с другой ногой.

# Glute_bridge_and_leg_lift_description
source: Glute Bridge and Leg Raise: Lie on your back with your legs bent. Raise your hips while squeezing your glutes. Lift your leg up, then slowly lower it. Repeat with the other leg.
ru: Ягодичный мостик и подъем ног: Лягте на спину, согните ноги. Поднимите бедра, напрягая ягодицы. Поднимите ногу вверх, затем медленно опустите. Повторите с другой ногой.

source: Toned buttocks
ru: Подтянутые ягодицы

source: Squat with side leg raise
ru: Приседание с боковым подъемом ног

# Squat_with_side_leg_raise_description
source: Squat Side Leg Raise: Squat down, then lift one leg to the side. Return to the starting position and repeat with the other leg.
ru: Приседание с боковым подъемом ног: Сделайте приседание, затем поднимите одну ногу в сторону. Вернитесь в исходное положение и повторите с другой ногой.

source: Flitter kickx
ru: Порхающие удары ногами

# Flitter_kickx_description
source: Flutter Kicks: Lie on your back with your legs elevated. Make small, quick movements of your legs up and down. Keep the body on the floor.
ru: Flutter kicks: Лягте на спину, поднимите ноги. Совершайте маленькие, быстрые движения ногами вверх и вниз. Удерживайте корпус на полу.

source: Jumping with crossing on one leg
ru: Прыжки с скрещиванием на одной ноге

# Jumping_with_crossing_on_one_leg_descrption
source: Single-Legged Jumping Jumps: Stand on one leg, bend the other and bring it toward your chest. Take a jump by swinging your arms and crossing your legs in the air. Repeat on the other leg.
ru: Прыжки со скрещиванием на одной ноге: Встаньте на одну ногу, согните другую и подтяните ее к груди. Совершите прыжок, раскачивая руки и скрещивая ноги в воздухе. Повторите на другой ноге.

source: Pull-ups with dumbbells
ru: Подтягивания с гантелями

# Pull_ups_with_dumbbells_description
source: Dumbbell Pull-Ups: Hold dumbbells by your sides and stand in front of a step or bench. Step on the bench with one foot, pushing off with your heel. Lift your other leg up and stand in a vertical position. Lower yourself onto the same leg and repeat on the other side.
ru: Подтягивания с гантелями: Возьмите гантели за бока, встаньте перед ступенькой или скамьей. Наступите на скамью одной ногой, отталкиваясь пяткой. Поднимите другую ногу вверх и встаньте в вертикальное положение. Опуститесь на ту же ногу и повторите с другой стороны.

source: Calf raises with squats
ru: Подъемы икры с приседаниями

# Calf_raises_with_squats_description
source: Calf raises with squats: Take dumbbells and stand straight. Do a squat, then lift your heels, squeezing your calf muscles. Lower your heels back to the floor and repeat.
ru: Подъемы икры с приседаниями: Возьмите гантели, станьте прямо. Сделайте приседание, затем поднимите пятки, напрягая мышцы икры. Опустите пятки обратно на пол и повторите.

source: Reaching the Bar
ru: Достижение планки

# Reaching_the_Bar_description
source: To reach the plank: Lie on the floor, resting on your forearms and toes, creating a straight line from head to toes. Tighten your core muscles while holding the pose for a certain amount of time.
ru: Достижение планки: Лягте на пол, опираясь на предплечья и носки, создавая прямую линию от головы до пят. Напрягите мышцы корпуса, удерживая позу в течение определенного времени.

source: Frog jumps
ru: Лягушка прыгает
